Catalogs/бит_Работы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_Работы</Name>
			<Comment>Перечень работ</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяНормаТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НормыТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЕдиницыИзмерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_КоэффициентыНорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_КоэффициентыНорм</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Норма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НормыТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СоставРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СоставРабот</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ЦеныРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЦеныРабот</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Норма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НормыТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_УстановкаСоставаРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаСоставаРаботы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СоставРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/бит_УстановкаЦенРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаЦенРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ЦеныРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦеныНаРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_НормыТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/бит_НормыТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_НормыТруда</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_Работы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_Работы/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура устанавливает отборы  
Процедура УстановитьОтборы()
	
	Эл = КоэффициентыНорм.Отбор.Работа;
	
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.Значение   = Объект.Ссылка;
	Эл.Использование    = Истина;
	
	ЭтаФорма.СоставРабот.Отбор.Элементы.Очистить();
	
	Эл = ЭтаФорма.СоставРабот.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Работа");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = Объект.Ссылка;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ЭтаФорма.ЦеныРабот.Отбор.Элементы.Очистить();

	Эл = ЭтаФорма.ЦеныРабот.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("СписокРабот");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Содержит;
	Эл.ПравоеЗначение   = Объект.Ссылка.Код;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельКоэффициентыОбновить(Команда)
	
	УстановитьОтборы();

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.НаименованиеПолное) тогда
		Объект.НаименованиеПолное      = Объект.Наименование;
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала сохраните справочник");
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.Подразделения.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	// Запретим удалять Подразделение если оно когда либо использовалось.
	УдалениеРазрешено = Истина;
	
	Отбор = Новый Структура("Подразделение", ТекущаяСтрока.Подразделение);
	
	Строки = Объект.Подразделения.НайтиСтроки(Отбор);
	
	Если Строки.Количество() <= 1 Тогда
		
		УдалениеРазрешено = ОпределитьВозможностьУдаленияПодразделения(ТекущаяСтрока.Подразделение);	
		
		Если НЕ УдалениеРазрешено Тогда
			Отказ = Истина;
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Существуют коэффициенты норм труда, состав работ или цены по подразделению <"+ТекущаяСтрока.Подразделение+">!
			|Удаление текущего Подразделения невозможно.");
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция определяет возможность удаления или изменения.
// В табличной части одного подразделения на другое.
// Параметры:
//	СпособРасчета - способ расчета, ссылки на который надо проверить.
// Возвращаемое значение:
//	Булево, истина - удалять/изменять можно.
&НаСервере
Функция ОпределитьВозможностьУдаленияПодразделения(Подразделение)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_КоэффициентыНормСрезПоследних.Подразделение
	               |ИЗ
	               |	РегистрСведений.бит_КоэффициентыНорм.СрезПоследних(
	               |			,
	               |			Работа = &Работа
	               |				И Подразделение = &Подразделение) КАК бит_КоэффициентыНормСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бит_СоставРаботСрезПоследних.Подразделение
	               |ИЗ
	               |	РегистрСведений.бит_СоставРабот.СрезПоследних(
	               |			,
	               |			Работа = &Работа
	               |				И Подразделение = &Подразделение) КАК бит_СоставРаботСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бит_ЦеныРаботСрезПоследних.Подразделение
	               |ИЗ
	               |	РегистрСведений.бит_ЦеныРабот.СрезПоследних(
	               |			,
	               |			Работа = &Работа
	               |				И Подразделение = &Подразделение) КАК бит_ЦеныРаботСрезПоследних";
	Запрос.УстановитьПараметр("Работа", Объект.Ссылка);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЕдиницыИзмеренияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала сохраните справочник");
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницыИзмеренияПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ЕдиницыИзмерения.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	// Запретим удалять Подразделение если оно когда либо использовалось.
	УдалениеРазрешено = Истина;
	
	Отбор = Новый Структура("ЕдиницаИзмерения", ТекущаяСтрока.ЕдиницаИзмерения);
	
	Строки = Объект.ЕдиницыИзмерения.НайтиСтроки(Отбор);
	
	Если Строки.Количество() <= 1 Тогда
		
		УдалениеРазрешено = ОпределитьВозможностьУдаленияПодразделения(ТекущаяСтрока.ЕдиницаИзмерения);	
		
		Если НЕ УдалениеРазрешено Тогда
			Отказ = Истина;
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Существуют нормы труда или цены по единице измерения <"+ТекущаяСтрока.ЕдиницаИзмерения+">!
				|Удаление текущей единицы измерения невозможно.");
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере".
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_Работы"));
	// Вызов механизма разделения прав доступа.
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ,СтандартнаяОбработка,СправочникОбъект,ЭтаФорма);	
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии".
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельЕдИзмОсновная(Команда)
	
	ТекущаяСтрока = Элементы.ЕдиницыИзмерения.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
			Для каждого Строка Из Объект.ЕдиницыИзмерения Цикл
				
				Строка.Основная = Ложь;
				
			КонецЦикла; 
			
			Объект.ОсновнаяЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
			
			ТекущаяСтрока.Основная          = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПодразделениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Элементы.Подразделения.ТекущиеДанные.Подразделение <> ВыбранноеЗначение Тогда
		УдалениеРазрешено = ОпределитьВозможностьУдаленияПодразделения(Элементы.Подразделения.ТекущиеДанные.Подразделение);
		Если НЕ УдалениеРазрешено Тогда
			СтандартнаяОбработка = Ложь;
			
			
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Существуют коэффициенты норм труда,
		    |состав работ или цены по подразделению <"+Элементы.Подразделения.ТекущиеДанные.Подразделение+">!
			|Изменение текущего Подразделения невозможно.");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НормыТрудаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала сохраните справочник");
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельНормыТрудаОсновная(Команда)
	
	
	ТекущаяСтрока = Элементы.НормыТруда.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		УстановитьОсновнаяНормаТрудаЛожьНаСервере(ТекущаяСтрока.Ссылка);
		
		Объект.ОсновнаяНормаТруда = ТекущаяСтрока.Ссылка;
		
		ТекущаяСтрока.Основная          = Истина;
		
		Элементы.НормыТруда.Обновить();
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьОсновнаяНормаТрудаЛожьНаСервере(СсылкаОсновная)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НормыТруда.Основная,
		|	бит_НормыТруда.Ссылка,
		|	бит_НормыТруда.Владелец
		|ИЗ
		|	Справочник.бит_НормыТруда КАК бит_НормыТруда
		|ГДЕ
		|	бит_НормыТруда.Владелец = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НормаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Если Не СсылкаОсновная = ВыборкаДетальныеЗаписи.Ссылка Тогда
			
			
			Если НЕ НормаОбъект.Основная = Ложь Тогда
				
				
				НормаОбъект.Основная = Ложь;
				Попытка
					НормаОбъект.Записать();
				Исключение
				КонецПопытки;
				
			КонецЕсли;
		Иначе	
			
			
			НормаОбъект.Основная = Истина;
			Попытка
				НормаОбъект.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура КоэффициентыНормПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЭтаФорма.Модифицированность = Истина ИЛИ Параметры.Ключ.Пустая() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала сохраните справочник");
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	
	
КонецПроцедуры
	


&НаСервере
Процедура ПрочитатьДанныеНабораЗаписейНаСервере()
	
	бит_КоэффициентыНормОбъект = ДанныеФормыВЗначение(КоэффициентыНорм, Тип("РегистрСведенийНаборЗаписей.бит_КоэффициентыНорм"));
	бит_КоэффициентыНормОбъект.Прочитать();
	
	ЗначениеВДанныеФормы(бит_КоэффициентыНормОбъект,КоэффициентыНорм);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Заголовок = "Нормы труда" Тогда
		
		ЭтаФорма.НормыТруда.Отбор.Элементы.Очистить();
		
		Эл = ЭтаФорма.НормыТруда.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Эл.ПравоеЗначение   = Объект.Ссылка;
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	ИначеЕсли ТекущаяСтраница.Заголовок = "Коэффициенты норм" Тогда
		
		ПрочитатьДанныеНабораЗаписейНаСервере();
		
	ИначеЕсли ТекущаяСтраница.Заголовок = "Состав работ" Тогда
		
		УстановитьОтборы();
		
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура СоставРаботВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбраннаяСтрока <> Неопределено тогда
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("Ключ",ВыбраннаяСтрока);
		
		НоваяФорма = ОткрытьФорму("Документ.бит_УстановкаСоставаРаботы.Форма.ФормаДокументаУправляемая",ПараметрыФормы,ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставРаботПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала сохраните справочник");
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Если Не Копирование Тогда
		
		Отказ = Истина;

		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("Работа",           Объект.Ссылка);
		ПараметрыФормы.Вставить("ЕдиницаИзмерения", Объект.ОсновнаяЕдиницаИзмерения);
		
		ОткрытьФорму("Документ.бит_УстановкаСоставаРаботы.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзСправочникаРаботы", ПараметрыФормы), Элемент);

	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКоэффициентНорм(Команда)
	
	Если ЭтаФорма.Модифицированность = Истина ИЛИ Параметры.Ключ.Пустая() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед добавлением коэффициентов элемент необходимо записать.");
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Работа",Объект.Ссылка);
	ПараметрыФормы.Вставить("Период",ТекущаяДата());
	ПараметрыФормы.Вставить("ЕдиницаИзмерения",Объект.ОсновнаяЕдиницаИзмерения);
	
	ПараметрыФормы.Вставить("Работа",Объект.Ссылка);
	
	
	ФормаОткрытия = ОткрытьФорму("РегистрСведений.бит_КоэффициентыНорм.Форма.ФормаЗаписиУправляемая",Новый Структура("ЗаполнитьИзСправочникаРаботы",ПараметрыФормы),ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьКоэффициенты" Тогда
		
		ПрочитатьДанныеНабораЗаписейНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныРаботПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЭтаФорма.Модифицированность = Истина ИЛИ Параметры.Ключ.Пустая() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала сохраните справочник");
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Если Не Копирование Тогда
		
		Отказ = Истина;
		
		
		ПараметрыФормы = Новый Структура;
		
		Если Объект.Подразделения.Количество() <> 0  Тогда
			Подразделение = Объект.Подразделения[0].Подразделение;
		КонецЕсли; 
		
		ПараметрыФормы.Вставить("Подразделение",Подразделение);
		ПараметрыФормы.Вставить("Работа",Объект.Ссылка);
		ПараметрыФормы.Вставить("Норма",Объект.ОсновнаяНормаТруда);
		
		ЕдиницаИзмерения = ЕдиницаИзмеренияНаСервере(Объект.ОсновнаяНормаТруда);
		ПараметрыФормы.Вставить("ЕдиницаИзмерения",ЕдиницаИзмерения);
		
		НоваяФорма = ОткрытьФорму("Документ.бит_УстановкаЦенРабот.Форма.ФормаДокументаУправляемая",Новый Структура("СоздатьИзСправочникаРаботы",ПараметрыФормы),ЭтаФорма);	
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ЕдиницаИзмеренияНаСервере(ОсновнаяНормаТруда)

	Возврат ОсновнаяНормаТруда.ЕдиницаИзмерения;

КонецФункции

#КонецОбласти
